Table of Contents
 Class GetEntriesRequest
Namespace
IdeaStatiCa.Plugin.Grpc
Assembly
IdeaStatiCa.Plugin.dll
public sealed class GetEntriesRequest : IMessage<GetEntriesRequest>, IEquatable<GetEntriesRequest>, IDeepCloneable<GetEntriesRequest>, IBufferMessage, IMessage
Inheritance
object
GetEntriesRequest
Implements
IMessage<GetEntriesRequest>
IEquatable<GetEntriesRequest>
IDeepCloneable<GetEntriesRequest>
IBufferMessage
IMessage
Inherited Members
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
Constructors
 GetEntriesRequest()
public GetEntriesRequest()
 GetEntriesRequest(GetEntriesRequest)
public GetEntriesRequest(GetEntriesRequest other)
Parameters
other GetEntriesRequest
Fields
 BlobStorageIdFieldNumber
Field number for the "blobStorageId" field.
public const int BlobStorageIdFieldNumber = 1
Field Value
int
Properties
 BlobStorageId
public string BlobStorageId { get; set; }
Property Value
string
 Descriptor
public static MessageDescriptor Descriptor { get; }
Property Value
MessageDescriptor
 Parser
public static MessageParser<GetEntriesRequest> Parser { get; }
Property Value
MessageParser<GetEntriesRequest>
Methods
 CalculateSize()
Calculates the size of this message in Protocol Buffer wire format, in bytes.
public int CalculateSize()
Returns
int
The number of bytes required to write this message to a coded output stream.
 Clone()
Creates a deep clone of this object.
public GetEntriesRequest Clone()
Returns
GetEntriesRequest
A deep clone of this object.
 Equals(GetEntriesRequest)
Indicates whether the current object is equal to another object of the same type.
public bool Equals(GetEntriesRequest other)
Parameters
other GetEntriesRequest
An object to compare with this object.
Returns
bool
true if the current object is equal to the other parameter; otherwise, false.
 Equals(object)
Determines whether the specified object is equal to the current object.
public override bool Equals(object other)
Parameters
other object
Returns
bool
true if the specified object is equal to the current object; otherwise, false.
 GetHashCode()
Serves as the default hash function.
public override int GetHashCode()
Returns
int
A hash code for the current object.
 MergeFrom(CodedInputStream)
Merges the data from the specified coded input stream with the current message.
public void MergeFrom(CodedInputStream input)
Parameters
input CodedInputStream
Remarks
See the user guide for precise merge semantics.
 MergeFrom(GetEntriesRequest)
Merges the given message into this one.
public void MergeFrom(GetEntriesRequest other)
Parameters
other GetEntriesRequest
Remarks
See the user guide for precise merge semantics.
 ToString()
Returns a string that represents the current object.
public override string ToString()
Returns
string
A string that represents the current object.
 WriteTo(CodedOutputStream)
Writes the data to the given coded output stream.
public void WriteTo(CodedOutputStream output)
Parameters
output CodedOutputStream
Coded output stream to write the data to. Must not be null.
 Edit this page